; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-86)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b15)
    (on b15 b24)
    (on-table b24)
    (clear b6)
    (on b6 b7)
    (on b7 b4)
    (on b4 b19)
    (on b19 b11)
    (on b11 b20)
    (on b20 b13)
    (on b13 b10)
    (on b10 b3)
    (on b3 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b22)
    (on b22 b14)
    (on b14 b8)
    (on b8 b12)
    (on-table b12)
    (clear b18)
    (on-table b18)
    (clear b16)
    (on b16 b25)
    (on b25 b9)
    (on-table b9)
    (clear b21)
    (on b21 b1)
    (on-table b1))
 (:goal (and 
(on-table b24)
(on b1 b21)
))
)

; plan
1. (unstack b21 b1)
   deleted: (on b21 b1) (clear b21) (arm-empty)
   added: (holding b21) (clear b1)
   goals met: 1 of 2
2. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 2
3. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 1 of 2
4. (stack b1 b21)
   deleted: (clear b21) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b21)
   goals met: 2 of 2
